ConfigFiles/Catalogs/КартинкиСправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КартинкиСправки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Comment>Дата изменения файла в базе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Comment>Размер файла</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Comment>Расширение файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКартинки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/ЭлементыСправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЭлементыСправки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОбъектыМетаданных</xr:Item>
				<xr:Item>Catalog.Подсистемы</xr:Item>
				<xr:Item>Catalog.ФормыОбъектовМетаданных</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильФорматированияСправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтилиФорматирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодменяющийЭлементСправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыСправки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВСправку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектыВключающиеСправкуСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГиперссылкиДляСправки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстГиперссылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гиперссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
								<v8:Type>cfg:CatalogRef.ФормыОбъектовМетаданных</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КартинкиДляСправки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НазваниеКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КартинкиСправки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроектыВключающиеСправку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/Подсистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Подсистемы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСправкуВСодержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрисутствуетВОсновномХранилище</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольДляПросмотра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВКомандныйИнтерфейс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаПоддержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеИзменений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСогласованияИзмененияВВетках</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеткаИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласующийИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазделыПроекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/КартинкиСправки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК КартинкиСправки
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыСправки.КартинкиДляСправки КАК КартинкиДляСправки
	|	ПО КартинкиДляСправки.Картинка = КартинкиСправки.Ссылка;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ТипЗначения(КартинкиДляСправки.Ссылка.Владелец) = Тип(Справочник.ФормыОбъектовМетаданных)
	|		ТОГДА ЗначениеРазрешено(ВЫРАЗИТЬ(КартинкиДляСправки.Ссылка.Владелец КАК Справочник.ФормыОбъектовМетаданных).Владелец)
	|		ИНАЧЕ ЗначениеРазрешено(КартинкиДляСправки.Ссылка.Владелец)
	|	КОНЕЦ";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОбъектыМетаданных(ОбъектыМетаданных, Проект) Экспорт
	
	КоллекцияОбъектов = ОбъектыМетаданных.ПолучитьЭлементы();	
	КоллекцияОбъектов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТипОбъектаИндексКартинки.ИндексКартинки КАК ИндексКартинки,
	|	ТаблицаТипОбъектаИндексКартинки.ТипОбъекта КАК ТипОбъекта
	|ПОМЕСТИТЬ ТаблицаТипОбъектаИндексКартинки
	|ИЗ
	|	&ТаблицаТипОбъектаИндексКартинки КАК ТаблицаТипОбъектаИндексКартинки
	|ГДЕ
	|	НЕ ТаблицаТипОбъектаИндексКартинки.ЭтоГруппа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТаблицаТипОбъектаИндексКартинки.ТипОбъекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КартинкиСправки.Ссылка КАК КартинкаСправки,
	|	КартинкиСправки.Наименование КАК Наименование,
	|	КартинкиСправки.Размер КАК Размер,
	|	КартинкиСправки.Расширение КАК Расширение,
	|	Подсистемы.Ссылка КАК Подсистема,
	|	Подсистемы.Имя КАК ИмяПодсистемы,
	|	ОбъектыМетаданных.Ссылка КАК ОбъектМетаданных,
	|	ОбъектыМетаданных.Имя КАК ИмяОбъектаМетаданных,
	|	ОбъектыМетаданных.Родитель КАК ТипОбъекта,
	|	ОбъектыМетаданных.Родитель.Имя КАК ИмяТипаОбъекта,
	|	ФормыОбъектовМетаданных.Ссылка КАК ФормаОбъекта,
	|	ФормыОбъектовМетаданных.Имя КАК ИмяФормыОбъекта,
	|	ФормыОбъектовМетаданных.Владелец КАК ФормаОбъектаОбъект,
	|	ФормыОбъектовМетаданных.Владелец.Имя КАК ФормаОбъектаИмяОбъекта,
	|	ФормыОбъектовМетаданных.Владелец.Родитель КАК ФормаОбъектаТипОбъекта,
	|	ФормыОбъектовМетаданных.Владелец.Родитель.Имя КАК ФормаОбъектаИмяТипаОбъекта,
	|	ЕСТЬNULL(ТаблицаТипОбъектаИндексКартинки.ИндексКартинки, 91) КАК ИндексКартинки
	|ИЗ
	|	Справочник.ЭлементыСправки КАК ЭлементыСправки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭлементыСправки.КартинкиДляСправки КАК КартинкиДляСправкиТЧ
	|		ПО (КартинкиДляСправкиТЧ.Ссылка = ЭлементыСправки.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КартинкиСправки КАК КартинкиСправки
	|		ПО (КартинкиДляСправкиТЧ.Картинка = КартинкиСправки.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подсистемы КАК Подсистемы
	|		ПО ЭлементыСправки.Владелец = Подсистемы.Ссылка
	|			И (Подсистемы.Владелец = &Проект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
	|		ПО ЭлементыСправки.Владелец = ОбъектыМетаданных.Ссылка
	|			И (ОбъектыМетаданных.Владелец = &Проект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТипОбъектаИндексКартинки КАК ТаблицаТипОбъектаИндексКартинки
	|		ПО (ОбъектыМетаданных.Родитель.Имя = ТаблицаТипОбъектаИндексКартинки.ТипОбъекта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормыОбъектовМетаданных КАК ФормыОбъектовМетаданных
	|		ПО ЭлементыСправки.Владелец = ФормыОбъектовМетаданных.Ссылка
	|			И (ФормыОбъектовМетаданных.Владелец.Владелец = &Проект)
	|ГДЕ
	|	(НЕ ОбъектыМетаданных.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ФормыОбъектовМетаданных.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ Подсистемы.Ссылка ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектМетаданных,
	|	ФормаОбъекта,
	|	Подсистема";
	
	ТаблицаТипОбъектаИндексКартинки = РаботаСОбъектамиМетаданных.ТаблицаТипОбъектаИндексКартинки();	
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("ТаблицаТипОбъектаИндексКартинки", ТаблицаТипОбъектаИндексКартинки);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	ЭлементыДерева = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Подсистема) Тогда
			
			ТипОбъекта = ЭлементыДерева.Получить(Справочники.Подсистемы.ПустаяСсылка());
			Если ТипОбъекта = Неопределено Тогда
				ТипОбъекта = КоллекцияОбъектов.Добавить();
				ТипОбъекта.Ссылка = Справочники.Подсистемы.ПустаяСсылка();
				ТипОбъекта.Представление = НСтр("ru = 'Подсистемы'");
				ТипОбъекта.ИндексКартинки = 19;
				ЭлементыДерева.Вставить(ТипОбъекта.Ссылка, ТипОбъекта);
			КонецЕсли;
			
			Подсистема = ЭлементыДерева.Получить(Выборка.Подсистема);
			Если Подсистема = Неопределено Тогда
				Подсистема = ТипОбъекта.ПолучитьЭлементы().Добавить(); 
				Подсистема.Ссылка = Выборка.Подсистема;
				Подсистема.Представление = Выборка.ИмяПодсистемы;
				Подсистема.ИндексКартинки = 19;
				ЭлементыДерева.Вставить(Подсистема.Ссылка, Подсистема);
			КонецЕсли;
			
			КартинкаСправки = Подсистема.ПолучитьЭлементы().Добавить();
			КартинкаСправки.Ссылка = Выборка.КартинкаСправки;
			КартинкаСправки.Представление = Выборка.Наименование;
			КартинкаСправки.ИндексКартинки = 97;
			КартинкаСправки.Размер = Выборка.Размер;
			КартинкаСправки.Расширение = Выборка.Расширение;
						
		ИначеЕсли ЗначениеЗаполнено(Выборка.ОбъектМетаданных) Тогда
			
			ТипОбъекта = ЭлементыДерева.Получить(Выборка.ТипОбъекта);
			Если ТипОбъекта = Неопределено Тогда
				ТипОбъекта = КоллекцияОбъектов.Добавить();
				ТипОбъекта.Ссылка = Выборка.ТипОбъекта;
				ТипОбъекта.Представление = Выборка.ИмяТипаОбъекта;
				ТипОбъекта.ИндексКартинки = Выборка.ИндексКартинки;
				ЭлементыДерева.Вставить(ТипОбъекта.Ссылка, ТипОбъекта);
			КонецЕсли;
			
			ОбъектМетаданных = ЭлементыДерева.Получить(Выборка.ОбъектМетаданных);
			Если ОбъектМетаданных = Неопределено Тогда
				ОбъектМетаданных = ТипОбъекта.ПолучитьЭлементы().Добавить(); 
				ОбъектМетаданных.Ссылка = Выборка.ОбъектМетаданных;
				ОбъектМетаданных.Представление = Выборка.ИмяОбъектаМетаданных;
				ОбъектМетаданных.ИндексКартинки = Выборка.ИндексКартинки;
				ЭлементыДерева.Вставить(ОбъектМетаданных.Ссылка, ОбъектМетаданных);
			КонецЕсли;

			КартинкаСправки = ОбъектМетаданных.ПолучитьЭлементы().Добавить();
			КартинкаСправки.Ссылка = Выборка.КартинкаСправки;
			КартинкаСправки.Представление = Выборка.Наименование;
	        КартинкаСправки.ИндексКартинки = 97;
			КартинкаСправки.Размер = Выборка.Размер;
			КартинкаСправки.Расширение = Выборка.Расширение;

		ИначеЕсли ЗначениеЗаполнено(Выборка.ФормаОбъекта) Тогда
			
			ТипОбъекта = ЭлементыДерева.Получить(Выборка.ФормаОбъектаТипОбъекта);
			Если ТипОбъекта = Неопределено Тогда
				ТипОбъекта = КоллекцияОбъектов.Добавить();
				ТипОбъекта.Ссылка = Выборка.ФормаОбъектаТипОбъекта;
				ТипОбъекта.Представление = Выборка.ФормаОбъектаИмяТипаОбъекта;
				ТипОбъекта.ИндексКартинки = Выборка.ИндексКартинки;
				ЭлементыДерева.Вставить(ТипОбъекта.Ссылка, ТипОбъекта);
			КонецЕсли;

			ОбъектМетаданных = ЭлементыДерева.Получить(Выборка.ФормаОбъектаОбъект);
			Если ОбъектМетаданных = Неопределено Тогда
				ОбъектМетаданных = ТипОбъекта.ПолучитьЭлементы().Добавить();
				ОбъектМетаданных.Ссылка = Выборка.ФормаОбъектаОбъект;
				ОбъектМетаданных.Представление = Выборка.ФормаОбъектаИмяОбъекта;
				ОбъектМетаданных.ИндексКартинки = Выборка.ИндексКартинки;
				ЭлементыДерева.Вставить(ОбъектМетаданных.Ссылка, ОбъектМетаданных);
			КонецЕсли;
			
			ФормаОбъекта = ЭлементыДерева.Получить(Выборка.ФормаОбъекта);
			Если ФормаОбъекта = Неопределено Тогда
				ФормаОбъекта = ОбъектМетаданных.ПолучитьЭлементы().Добавить(); 
				ФормаОбъекта.Ссылка = Выборка.ФормаОбъекта;
				ФормаОбъекта.Представление = Выборка.ИмяФормыОбъекта;
				ФормаОбъекта.ИндексКартинки = 47;
				ЭлементыДерева.Вставить(ФормаОбъекта.Ссылка, ФормаОбъекта);
			КонецЕсли;

			КартинкаСправки = ФормаОбъекта.ПолучитьЭлементы().Добавить();
			КартинкаСправки.Ссылка = Выборка.КартинкаСправки;
			КартинкаСправки.Представление = Выборка.Наименование;
			КартинкаСправки.ИндексКартинки = 97;
			КартинкаСправки.Размер = Выборка.Размер;
			КартинкаСправки.Расширение = Выборка.Расширение;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНеИспользуемыеКартинки(НеиспользуемыеКартинки) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КартинкиСправки.Ссылка,
	|	КартинкиСправки.Представление,
	|	КартинкиСправки.Размер,
	|	КартинкиСправки.Расширение
	|ИЗ
	|	Справочник.КартинкиСправки КАК КартинкиСправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыСправки КАК ЭлементыСправки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭлементыСправки.КартинкиДляСправки КАК КартинкиДляСправкиТЧ
	|			ПО (КартинкиДляСправкиТЧ.Ссылка = ЭлементыСправки.Ссылка)
	|		ПО (КартинкиДляСправкиТЧ.Картинка = КартинкиСправки.Ссылка)
	|ГДЕ
	|	ЭлементыСправки.Ссылка ЕСТЬ NULL ";
		
	Результат = Запрос.Выполнить();
	
	НеИспользуемыеКартинки.Загрузить(Результат.Выгрузить());
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
